<a href="https://colab.research.google.com/github/nickwharff/CS167_Notes/blob/main/Day02_P2_Pandas_Exercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# CS167: Day02 
## Part 2: Practicing with Pandas

#### CS167: Machine Learning, J-Term 2023

Wednesday, January 4th, 2023 -- Session II (10:20-11:35)

[⏮ Day02 Part 1]() [⏩ Day03 Part 1]()

## Admin Stuff:

You should be working on: 
- Notebook 0: Onboarding was due (although you didn't have anything to turn in) before class
- Notebook #1 is released today, and will be due before class on Thursday 1/5.

# Notebook #1: Python, Pandas and Pokemon, Oh My!

I give you starter code, `notebook1_starter.ipynb`, please use it.
There are 6 exercises, each worth 1 point. 

The dataset for this notebook can be found on Blackboard. 

[Link to Notebook #1](https://classroom.github.com/a/FNH0KzX1)

# Pandas Practice Exercises
These are some exercises for you to practice playing around with pandas. 
- these are not going to be turned in, they're just practice.
- I'll post solutions tonight

I hope these exercises will leave you in a good spot to tackle Notebook #1. 

## Let's get started
Before you begin, make sure that you download the data from Blackboard and put it in your Google Dive wher eyou know how to find it (preferable in a datasets folder).

In [2]:
#selecting columns in dataframes
import pandas as pd
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [3]:
#import the data:
#make sure the path on the line below corresponds to the path where you put your dataset.
titanic = pd.read_csv("/content/drive/MyDrive/CS167/datasets/titanic.csv")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
# what is the data type of titanic?

# type(df)

type(titanic)

pandas.core.frame.DataFrame

In [5]:
# what are the features (column titles) of the titanic dataset?

titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [7]:
# display only the 'embark_town' column of the titanic data

titanic['embark_town'].head()

0    Southampton
1      Cherbourg
2    Southampton
3    Southampton
4    Southampton
Name: embark_town, dtype: object

In [8]:
# what is the data type of the result of the previous cell? 

type(titanic.embark_town)

pandas.core.series.Series

In [9]:
# what is the "shape" of the data frame?

titanic.shape

(891, 15)

In [11]:
# make a subset (call the variable 'subset') of the data that consists of the last 20 rows of the data;
# verify that your subset has 20 rows

subset = titanic.loc[871:]

subset.shape

(20, 15)

In [13]:
# use loc to print out the data for passenger 890 on the titanic dataframe

subset.loc[890]

# use iloc to print out the data for passenger 890 on the subest dataframe

subset.iloc[19]

survived                0
pclass                  3
sex                  male
age                  32.0
sibsp                   0
parch                   0
fare                 7.75
embarked                Q
class               Third
who                   man
adult_male           True
deck                  NaN
embark_town    Queenstown
alive                  no
alone                True
Name: 890, dtype: object

In [ ]:
# use a markdown cell; describe the difference between loc and iloc

`loc` uses index name of entire set

`iloc` uses relative position

In [17]:
# create a subset of the data (call the variable 'queenstown_subset') that consists only of passengers with
# a 'embark_town' that is "Queenstown"

queenstown_subset = titanic[titanic['embark_town'] == 'Queenstown']

queenstown_subset.head()

# hint: if you get a warning, you may need to explicitly note that you are making a copy of the original data by using 
# the .copy() function

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
22,1,3,female,15.0,0,0,8.0292,Q,Third,child,False,NaN,Queenstown,yes,True
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True
32,1,3,female,NaN,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True

In [18]:
# how many passengers are in queenstown_subset?

queenstown_subset.shape

# 77 passengers

(77, 15)

In [19]:
# what is the average fare for all of those in the queenstown_subset?

queenstown_subset.fare.mean()

# average fair was $13 and change

13.276029870129872

In [21]:
# what is the average age for all of those in the queenstown_subset?

queenstown_subset.age.mean()


# do all of the passengers have an age recorded? What is recorded if there is no age?

# No, some do not have an age recorded, instead have 'NaN' or 'Not a Number'

28.089285714285715

In [ ]:
# What does unique(), mean(), isnull(), and fillna() do? Use a markdown cell to write your answers
# Use the Pandas documentation (https://pandas.pydata.org/pandas-docs/stable/reference/index.html)

- `unique()` gives you a list of all unique values in a given column, written as `df.type.unique()`

- `mean()` gives you the mean of a given column, written `df.type.mean()`

- `isnull()` returns a series where each value is True/False, true if value isnull ie 'NaN' or something written `df.type.isnull()`

- `fillna()` replaces all na values with a value that you run through the function `df.type.fillna('value')`

In [25]:
# give examples of your use of unique(), mean(), median(), isnull()
titanic.embark_town.unique()

titanic.age.mean()

titanic.age.median()

titanic.age.isnull().head()

0    False
1    False
2    False
3    False
4    False
Name: age, dtype: bool

In [28]:
# in the queenstown_subset dataframe
# for each row that does not have an age recorded, replace the NaN value with the calculated average
# hint: don't use a loop; it can be done in 1 line of code using fillna()

fill_queens = queenstown_subset.age.fillna(queenstown_subset.age.mean())

fill_queens.head()

5     28.089286
16     2.000000
22    15.000000
28    28.089286
32    28.089286
Name: age, dtype: float64

In [35]:
# load in the iris data

iris =pd.read_csv("/content/drive/MyDrive/CS167/datasets/irisData.csv")

iris.head()
# what is the median sepal width of just the Setosas?

setosas = iris[iris['species'] == "Iris-setosa"]

setosas['sepal width'].median()

   sepal length  sepal width  petal length  petal width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [40]:
# for those iris that are classified as versicolor and have 
# a petal-length > 4, what is the average sepal width?

versicolor_and_four = iris[(iris['species'] == 'Iris-versicolor') & (iris['petal length'] > 4)]['sepal width'].mean()

versicolor_and_four

versicolor_and_four = iris[(iris['species'] == 'Iris-versicolor') & (iris['petal length'] > 4)]

versicolor_and_four['sepal width'].mean()

2.902941176470588

Congrats! Now you're ready to move on to Notebook #1!